<h1 style="text-align: center;">Sprint 3: Tarea 1 - Programación Numérica</h1>

In [1]:
#importamos librerias 
import pandas as pd

**EJERCICI 1**: Dado el siguiente dataframe data = {'Col1': [50, 30, 10, 40, 20]}, ordena los valores en orden ascendente y descendente.

In [2]:
data = {'Col1': [50, 30, 10, 40, 20]}

In [3]:
df = pd.DataFrame(data)
df

   Col1
0    50
1    30
2    10
3    40
4    20

In [4]:
#Ordenar de forma ascendente
df.sort_values(by=['Col1'], ascending=True)

   Col1
2    10
4    20
1    30
3    40
0    50

In [5]:
#Ordenar de forma descendente
df.sort_values(by=['Col1'], ascending=False)

   Col1
0    50
3    40
1    30
4    20
2    10

**EJERCICIO 2**: Dado el siguiente dataframe data = {'Col1': [50, 30, 10, 40, 20]}, filtra los valores que sean mayores que 30.

In [7]:
data_2 = {'Col1': [50, 30, 10, 40, 20]}

In [8]:
df2 = pd.DataFrame(data_2)

In [9]:
#Valores mayores a 30
df2[df2['Col1'] > 30]

   Col1
0    50
3    40

**EJERCICIO 3**: Dado el siguiente dataframe data = {'Col1': [50, 30, 10, 40, 10]}, contabiliza los valores únicos.

In [10]:
data_3 = {'Col1': [50, 30, 10, 40, 10]}

In [11]:
df3 = pd.DataFrame(data_3)

In [13]:
#contabilizamos valores unicos 
df3['Col1'].value_counts()

Col1
10    2
50    1
30    1
40    1
Name: count, dtype: int64

**EJERCICIO 4**: Dado el siguiente dataframe: data = {'Grupo': ['A', 'B', 'A', 'B', 'A'], 'Col1': [10, 20, 30, 40, 50]} , suma los datos que pertenecen a la misma columna.

In [14]:
data_4 = {'Grupo': ['A', 'B', 'A', 'B', 'A'], 'Col1': [10, 20, 30, 40, 50]}

In [16]:
df4 = pd.DataFrame(data_4)
df4

  Grupo  Col1
0     A    10
1     B    20
2     A    30
3     B    40
4     A    50

In [20]:
df4.sum()

Grupo    ABABA
Col1       150
dtype: object

In [17]:
#sumando datos que pertenecen a la misma columna
df4.groupby(['Grupo']).sum()

       Col1
Grupo
A        90
B        60

**EJERCICIO 5**: Dado el siguiente dataframe: data = {'Grupo': ['A', 'B', 'A', 'B', 'A'], 'Col1': [10, 20, 30, 40, 50]} , crea una columna nueva 'Col2' que sea 2 si es superior al percentil 75% de la 'Col1', 0 si es inferior al 25% del percentil de la columna 'Col1' y 1 si cae en medio.

In [22]:
data_5 = {'Grupo': ['A', 'B', 'A', 'B', 'A'], 'Col1': [10, 20, 30, 40, 50]}

In [23]:
df5 = pd.DataFrame(data_5)

In [24]:
#creamos 'col2' con valor 2 si es superior al percentil 75 de la columna 'Col1', 0 si es inferior al 25 y 1 si cae en el medio
df5['Col2'] = df5['Col1'].apply(lambda x: 2 if x > df5['Col1'].quantile(.75) else 0 if x < df5['Col1'].quantile(.25) else 1)

In [25]:
df5

  Grupo  Col1  Col2
0     A    10     0
1     B    20     1
2     A    30     1
3     B    40     1
4     A    50     2

**EJERCICIO 6**: Dado el siguiente dataframe: data = {'Grupo': ['A', 'B', 'A', 'B', 'A'], 'Col1': [10, 20, 30, 40, 50]} , aplica lambda para obtener el cuadrado de la columna 'Col1' en una nueva columna.

In [27]:
data_6 = {'Grupo': ['A', 'B', 'A', 'B', 'A'], 'Col1': [10, 20, 30, 40, 50]}

In [29]:
df6 = pd.DataFrame(data_6)

In [31]:
#creamos la columna 'cuadrado que representa el cuadrado de la col1
df6['cuadrado'] = df6['Col1'].apply(lambda x: x**2)
df6

  Grupo  Col1  cuadrado
0     A    10       100
1     B    20       400
2     A    30       900
3     B    40      1600
4     A    50      2500